In [1]:
import pandas as pd

In [2]:
obj=pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj=pd.series([4,7,-5,3])
obj

AttributeError: module 'pandas' has no attribute 'series'

In [4]:
obj=pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj2=pd.Series([4,5,6,-1],index=["d",'g','a','c'])
obj2

d    4
g    5
a    6
c   -1
dtype: int64

In [6]:
obj2[g]

NameError: name 'g' is not defined

In [7]:
obj2['g']

5

In [8]:
obj2[obj2>0]

d    4
g    5
a    6
dtype: int64

In [9]:
'd'in obj2

True

In [10]:
"e" in obj2

False

In [11]:
"a" in obj2

True

In [12]:
sdata={'Ohio':35000,'Texas':22222,'Jane':23456,'Armm':12345}
obj3=pd.Series(sdata)

In [13]:
obj3

Ohio     35000
Texas    22222
Jane     23456
Armm     12345
dtype: int64

In [14]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [15]:
obj.index=['Bob','Steve','Jeff','Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [16]:
data={'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],'year':[2000,2001,2002,2001,2002,2003],'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
frame=pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [17]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [19]:
pop={'Nevada':{2001:2.4,2002:2.9},'Ohio':{2000:1.5,2002:3.6}}
frame3=pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   NaN
2002     2.9   3.6

In [20]:
pd.DataFrame(pop,index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   NaN
2002     2.9   3.6
2003     NaN   NaN

In [21]:
frame3.index.name='year';
frame3

      Nevada  Ohio
year
2000     NaN   1.5
2001     2.4   NaN
2002     2.9   3.6

In [22]:
frame3.index.name='year'
frame3.columns.name='state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   NaN
2002      2.9   3.6

In [23]:
frame3.values

array([[nan, 1.5],
       [2.4, nan],
       [2.9, 3.6]])

In [24]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   NaN
2002      2.9   3.6

In [25]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [26]:
obj=pd.Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])

In [27]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [30]:
obj2=obj.reindex(['a','b','c','d','e'])

In [31]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [4]:
import pandas as pd
import numpy as np
frame=pd.DataFrame(np.arange(9).reshape((3,3)),index=['a','c','d'],columns=['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [5]:
frame2=frame.reindex(['a','b','c','d'])

In [6]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [7]:
states=['Texas','Utah','California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [8]:
obj=pd.Series(np.arange(5.),index=['a','b','c','d','e'])

In [9]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [10]:
new_obj=obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [11]:
obj.drop('d')

a    0.0
b    1.0
c    2.0
e    4.0
dtype: float64

In [18]:
data=pd.DataFrame(np.arange(16).reshape((4,4)),index=['Ohio','Colorado','Utah','New York'],columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [4]:
import pandas as pd
frame=pd.DataFrame({'b':[4,7,-3,-2],'a':[0,1,0,1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3 -2  1

In [5]:
frame.sort_values(by='b')

   b  a
2 -3  0
3 -2  1
0  4  0
1  7  1

In [9]:
import pandas as pd
import numpy as np
df1=pd.DataFrame(np.arange(12).reshape((3,4)),columns=list('abcd'))
df2=pd.DataFrame(np.arange(20).reshape((4,5)),columns=list('abcde'))
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [10]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [11]:
df2.loc[1,'b']=np.nan
df2

    a     b   c   d   e
0   0   1.0   2   3   4
1   5   NaN   7   8   9
2  10  11.0  12  13  14
3  15  16.0  17  18  19

In [13]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [14]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [15]:
df1.add(df2,fill_value=None)

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [16]:
df1.add(df2,fill_value=1)#df1,df2NaN11df1df2

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   5.0
1   9.0   6.0  13.0  15.0  10.0
2  18.0  20.0  22.0  24.0  15.0
3  16.0  17.0  18.0  19.0  20.0